org/clbind-doc.org
#+title: Exposing C++ Libraries with clbind
#+OPTIONS: ^:nil

* Note on this document
This document contains information on creating was created by piecing together information from different sources during the creation of the SFML binding.
It is the result of conversations on #clasp, trial and error, and reading source code, provided in the hope that it can help other early adopters of clasp.
It is not an official documentation, and is neither complete nor does it claim correctness.

Due to the alpha status of clasp, everything in this document is subject to change.

* General information
clbind is based on luabind. Many things can be derived from looking at the [[http://www.rasterbar.com/products/luabind/docs.html][luabind documentation]].

* Structure of a Binding
Clasp is able to load c++ libraries. Because C++ has no standard for its name mangling, Clasp needs an entrance point that it can find in every exposed library and from where it can derive the names of all other exposed functionality. This entrance point is provided by an ~extern "C"~ function called ~CLASP_MAIN~. 
Within this function, packages can be declared that will contain methods exposing the desired functionality within Clasp.

Thus, code should include a section like this:


#+BEGIN_SRC C++
extern "C" 
{
  EXPORT
  void CLASP_MAIN()
  {
    using namespace clbind;
     package("package-name")
     [
       //exposure of classes and functions for use in this package
     ];
  }
}
#+END_SRC

* Include Files
Compiling the binding requires the inclusion of several header files. Some of those are required, while some are only needed if [[Translators][translators]] are being written or existing translators, e.g. for string conversion are being used. These are the files I currently include, the status is not clear on all of them:
#+BEGIN_SRC C++
#include "src/clbind/clbind.h"       //required (or really just clbind/clbind.h ?)
#include "src/core/lispVector.h"     //required, if writing converters
#include "src/core/vectorObjects.h"  //for automatic conversion from and
#include "src/core/cons.h"           //into c++ objects.
#include "src/core/translators.h"    //assorted translators for string etc
#+END_SRC

