clbind-doc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Exposing C++ Libraries with clbind</title>
<!-- 2016-06-15 Wed 22:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Flash" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/><link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/></head>
<body>
<div id="preamble" class="status">
<div id="top-menu">
<ul>
<li><a href="index.html">Clasp</a>
<ul>
<li><a href="news.html">News</a>
</li>
<li><a href="features.html">Features</a>
</li>
<li><a href="download.html">Download</a>
</li>
</ul>
</li>
<li><a href="index.html">Doc</a>
<ul>
<li><a href="license.html">License</a>
</li>
<li><a href="building.html">Building Clasp</a>
</li>
<li><a href="clbind-doc.html">Exposing C++ Libraries</a>
</li>
</ul>
</li>
<li><a href="index.html">Misc</a>
<ul>
<li><a href="community.html">Community</a>
</li>
<li><a href="projects.html">Projects</a>
</li>
<li><a href="media.html">Media</a>
</li>
<li><a href="acknowlegements.html">Acknowledgements</a>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="content">
<h1 class="title">Exposing C++ Libraries with clbind</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Note on this document</a></li>
<li><a href="#sec-2">2. General information</a></li>
<li><a href="#sec-3">3. Structure of a Binding</a></li>
<li><a href="#sec-4">4. Include Files</a></li>
<li><a href="#sec-5">5. Exposing Functions</a>
<ul>
<li><a href="#sec-5-1">5.1. Overloaded Functions</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Exposing Classes</a>
<ul>
<li><a href="#sec-6-1">6.1. Inheritance</a></li>
<li><a href="#sec-6-2">6.2. Constructors</a></li>
<li><a href="#sec-6-3">6.3. Member Functions</a></li>
<li><a href="#sec-6-4">6.4. Static Member Function</a></li>
<li><a href="#sec-6-5">6.5. Public Member Variables</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Translators</a>
<ul>
<li><a href="#sec-7-1">7.1. Translation from C++ objects to Common Lisp objects</a></li>
<li><a href="#sec-7-2">7.2. Translation from Common Lisp objects to C++ objects</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Exposing Enums</a></li>
<li><a href="#sec-9">9. Policies</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Note on this document</h2>
<div class="outline-text-2" id="text-1">
<p>
This document contains information on creating was created by piecing together information from different sources during the creation of the SFML binding.
It is the result of conversations on #clasp, trial and error, and reading source code, provided in the hope that it can help other early adopters of clasp.
It is not an official documentation, and is neither complete nor does it claim correctness.
</p>

<p>
Due to the alpha status of clasp, everything in this document is subject to change.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> General information</h2>
<div class="outline-text-2" id="text-2">
<p>
clbind is based on luabind. Many things can be derived from looking at the <a href="http://www.rasterbar.com/products/luabind/docs.html">luabind documentation</a>.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Structure of a Binding</h2>
<div class="outline-text-2" id="text-3">
<p>
Clasp is able to load c++ libraries. Because C++ has no standard for its name mangling, Clasp needs an entrance point that it can find in every exposed library and from where it can derive the names of all other exposed functionality. This entrance point is provided by an <code>extern "C"~ function called ~CLASP_MAIN</code>. 
Within this function, packages can be declared that will contain methods exposing the desired functionality within Clasp.
</p>

<p>
Thus, code should include a section like this:
</p>


<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">extern</span> <span class="org-string">"C"</span> 
{
  EXPORT
  <span class="org-type">void</span> <span class="org-function-name">CLASP_MAIN</span>()
  {
    <span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">clbind</span>;
     package(<span class="org-string">"package-name"</span>)
     [
       <span class="org-comment-delimiter">//</span><span class="org-comment">exposure of classes and functions for use in this package</span>
     ];
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Include Files</h2>
<div class="outline-text-2" id="text-4">
<p>
Compiling the binding requires the inclusion of several header files. Some of those are required, while some are only needed if <a href="#sec-7">translators</a> are being written or existing translators, e.g. for string conversion are being used. These are the files I currently include, the status is not clear on all of them:
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">"src/clbind/clbind.h"</span>       <span class="org-comment-delimiter">//</span><span class="org-comment">required (or really just clbind/clbind.h ?)</span>
<span class="org-preprocessor">#include</span> <span class="org-string">"src/core/lispVector.h"</span>     <span class="org-comment-delimiter">//</span><span class="org-comment">required, if writing converters</span>
<span class="org-preprocessor">#include</span> <span class="org-string">"src/core/vectorObjects.h"</span>  <span class="org-comment-delimiter">//</span><span class="org-comment">for automatic conversion from and</span>
<span class="org-preprocessor">#include</span> <span class="org-string">"src/core/cons.h"</span>           <span class="org-comment-delimiter">//</span><span class="org-comment">into c++ objects.</span>
<span class="org-preprocessor">#include</span> <span class="org-string">"src/core/translators.h"</span>    <span class="org-comment-delimiter">//</span><span class="org-comment">assorted translators for string etc</span>
</pre>
</div>
</div>
</div>
