org/clbind-doc.org
* Exposing Functions
Exposing functions is done via the function ~def~:
#+BEGIN_SRC C++
template <typename F, class Policies>
scope def(char     const* name,
          F               f,
          Policies const& policies,
          string   const& lambdalist = "",
          string   const& declares   = "",
          string   const& docstring  = "" )
#+END_SRC
In this function
- name :: is the name that the function will have in clasp. It is automatically lispified, i.e. a name  with camel-casing is converted to a downcase name with dashes in between. Using this automatic lispification is optional, and it can be useful to use names following lisp conventions, so that a reader can immediately see how the respective lisp function is called.
- f :: is the function pointer to the c++ function.
- policies :: Gives additional information about how to handle some parameters (see [[Policies][Policies]]). An overloaded version of def does not have this parameter and uses the standard ~policies<>()~.
- lambdalist :: This optional parameter is an ordinary [[http://www.lispworks.com/documentation/lw60/CLHS/Body/03_da.htm][lambda-list]] as in Common Lisp's ~defun~. For every binding in the lambda list there has to be a corresponding argument in the C++ function. If the argument is an empty string, every parameter of the C++ function will be a required parameter in Common Lisp, even those that have default initializers. It is highly recommended to not leave the lambda list empty, even if you want to expose all parameters in a standard fashion. The lambda list provided here is used by slime for all kinds of support, e.g. to name and highlight the parameters when writing a function.
The lambda list is evaluated by lisp. As a consequence having ~&optional~ parameters without an init-form is normally not a good idea, as ~nil~ would be passed to the function. Unless you have written a [[Translators][translator]] that translates from ~nil~ to the required type, this will not work. Specifically, it might be tempting to think that providing an optional parameter in a lambda list for a parameter that has a default value in the C++ function would select that default value. However, this is not the case. You need to provide the lisp equivalent of that default value as an init-form to the optional parameter.
- declares :: This optional parameter represents the declaration part of a Common Lisp defun, but is currently unused.
- docstring :: This optional parameter defines the docstring that is used for this function within clasp, e.g. for functions like ~documentation~ and ~describe~. This is currently non-working, due to a bug.

Suppose a C++ function 
#+BEGIN_SRC C++
double addThreeNumbers(double x, double y, double z);
#+END_SRC
A complete binding could look like this (only the first two parameters are required) 
#+BEGIN_SRC C++
def("addThreeNumbers", &addThreeNumbers, policies<>(),
    "(x &optional (y 0) (z 0))", "",
    "Return the addition of all three arguments. y and z are optional and default to 0."),
#+END_SRC
From clasp, this function can be called with 
~(add-three-numbers 1)~ or ~(add-three-numbers 1 2)~ or ~(add-three-numbers 1 2 3)~.
The C++ function is called as ~addThreeNumbers(1,0,0)~, ~addThreeNumbers(1,2,0)~ and ~addThreeNumbers(1,2,3)~, respectively.

** Overloaded Functions
To expose overloaded functions, you have to cast the function pointer to the correct signature. Suppose the function from the previous example would be overloaded. It would then need an exposure such as this:
#+BEGIN_SRC C++
def("addThreeNumbers", (double(*)(double, double, double)) &addThreeNumbers),
#+END_SRC

* Exposing Classes
Exposing a class is done via the class ~class_~:
#+BEGIN_SRC C++
class_<CppClassName>("lisp-class-name")
#+END_SRC
Creates a Binding to the C++ class ~CppClassName~, with the name ~lisp-class-name~ in lisp.
This automatically creates a binding to the default constructor as well. (?? The default constructor is called ~default_ctor~ - how are default constructors differentiated ??)
To prevent the automatic creation of a default constructor, use a second parameter:
#+BEGIN_SRC C++
class_<CppClassName>("lisp-class-name", no_default_constructor)
#+END_SRC

** Inheritance
clbind can handle member functions of derived classes correctly, providing that they are exposed.
To expose the inheritance structure of C++ classes, expose the base class, and use the following format for the derived class:
#+BEGIN_SRC C++
class_<CppDerivedClassName, CppBaseClassName>("lisp-class-name")
#+END_SRC
If multiple inheritance brings in several base classes, use the following format:
#+BEGIN_SRC C++
class_<CppDerivedClassName, bases<CppBaseClassName1, CppBaseClassName2>>("lisp-class-name")
#+END_SRC
If a base class is a pure virtual class, i.e. it has only pure virtual functions or its constructor is private, make sure to use the ~no_default_constructor~ option when exposing the base class, otherwise you will get a compilation error.

