clbind-doc.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Exposing Functions</h2>
<div class="outline-text-2" id="text-5">
<p>
Exposing functions is done via the function <code>def</code>:
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">template</span> &lt;<span class="org-keyword">typename</span> <span class="org-type">F</span>, <span class="org-keyword">class</span> <span class="org-type">Policies</span>&gt;
<span class="org-type">scope</span> <span class="org-function-name">def</span>(<span class="org-type">char</span>     <span class="org-keyword">const</span>* <span class="org-variable-name">name</span>,
          <span class="org-type">F</span>               <span class="org-variable-name">f</span>,
          <span class="org-type">Policies</span> <span class="org-keyword">const</span>&amp; <span class="org-variable-name">policies</span>,
          <span class="org-type">string</span>   <span class="org-keyword">const</span>&amp; <span class="org-variable-name">lambdalist</span> = <span class="org-string">""</span>,
          <span class="org-type">string</span>   <span class="org-keyword">const</span>&amp; <span class="org-variable-name">declares</span>   = <span class="org-string">""</span>,
          <span class="org-type">string</span>   <span class="org-keyword">const</span>&amp; <span class="org-variable-name">docstring</span>  = <span class="org-string">""</span> )
</pre>
</div>
<p>
In this function
</p>
<dl class="org-dl">
<dt> name </dt><dd>is the name that the function will have in clasp. It is automatically lispified, i.e. a name  with camel-casing is converted to a downcase name with dashes in between. Using this automatic lispification is optional, and it can be useful to use names following lisp conventions, so that a reader can immediately see how the respective lisp function is called.
</dd>
<dt> f </dt><dd>is the function pointer to the c++ function.
</dd>
<dt> policies </dt><dd>Gives additional information about how to handle some parameters (see <a href="#sec-9">Policies</a>). An overloaded version of def does not have this parameter and uses the standard <code>policies&lt;&gt;()</code>.
</dd>
<dt> lambdalist </dt><dd>This optional parameter is an ordinary <a href="http://www.lispworks.com/documentation/lw60/CLHS/Body/03_da.htm">lambda-list</a> as in Common Lisp's <code>defun</code>. For every binding in the lambda list there has to be a corresponding argument in the C++ function. If the argument is an empty string, every parameter of the C++ function will be a required parameter in Common Lisp, even those that have default initializers. It is highly recommended to not leave the lambda list empty, even if you want to expose all parameters in a standard fashion. The lambda list provided here is used by slime for all kinds of support, e.g. to name and highlight the parameters when writing a function.
</dd>
</dl>
<p>
The lambda list is evaluated by lisp. As a consequence having <code>&amp;optional</code> parameters without an init-form is normally not a good idea, as <code>nil</code> would be passed to the function. Unless you have written a <a href="#sec-7">translator</a> that translates from <code>nil</code> to the required type, this will not work. Specifically, it might be tempting to think that providing an optional parameter in a lambda list for a parameter that has a default value in the C++ function would select that default value. However, this is not the case. You need to provide the lisp equivalent of that default value as an init-form to the optional parameter.
</p>
<dl class="org-dl">
<dt> declares </dt><dd>This optional parameter represents the declaration part of a Common Lisp defun, but is currently unused.
</dd>
<dt> docstring </dt><dd>This optional parameter defines the docstring that is used for this function within clasp, e.g. for functions like <code>documentation</code> and <code>describe</code>. This is currently non-working, due to a bug.
</dd>
</dl>

<p>
Suppose a C++ function 
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-type">double</span> <span class="org-function-name">addThreeNumbers</span>(<span class="org-type">double</span> <span class="org-variable-name">x</span>, <span class="org-type">double</span> <span class="org-variable-name">y</span>, <span class="org-type">double</span> <span class="org-variable-name">z</span>);
</pre>
</div>
<p>
A complete binding could look like this (only the first two parameters are required) 
</p>
<div class="org-src-container">

<pre class="src src-C++">def(<span class="org-string">"addThreeNumbers"</span>, &amp;addThreeNumbers, <span class="org-type">policies</span>&lt;&gt;(),
    <span class="org-string">"(x &amp;optional (y 0) (z 0))"</span>, <span class="org-string">""</span>,
    <span class="org-string">"Return the addition of all three arguments. y and z are optional and default to 0."</span>),
</pre>
</div>
<p>
From clasp, this function can be called with 
<code>(add-three-numbers 1)</code> or <code>(add-three-numbers 1 2)</code> or <code>(add-three-numbers 1 2 3)</code>.
The C++ function is called as <code>addThreeNumbers(1,0,0)</code>, <code>addThreeNumbers(1,2,0)</code> and <code>addThreeNumbers(1,2,3)</code>, respectively.
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Overloaded Functions</h3>
<div class="outline-text-3" id="text-5-1">
<p>
To expose overloaded functions, you have to cast the function pointer to the correct signature. Suppose the function from the previous example would be overloaded. It would then need an exposure such as this:
</p>
<div class="org-src-container">

<pre class="src src-C++">def(<span class="org-string">"addThreeNumbers"</span>, (<span class="org-type">double</span>(*)(<span class="org-type">double</span>, <span class="org-type">double</span>, <span class="org-type">double</span>)) &amp;addThreeNumbers),
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Exposing Classes</h2>
<div class="outline-text-2" id="text-6">
<p>
Exposing a class is done via the class <code>class_</code>:
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-type">class_</span>&lt;CppClassName&gt;(<span class="org-string">"lisp-class-name"</span>)
</pre>
</div>
<p>
Creates a Binding to the C++ class <code>CppClassName</code>, with the name <code>lisp-class-name</code> in lisp.
This automatically creates a binding to the default constructor as well. (?? The default constructor is called <code>default_ctor</code> - how are default constructors differentiated ??)
To prevent the automatic creation of a default constructor, use a second parameter:
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-type">class_</span>&lt;CppClassName&gt;(<span class="org-string">"lisp-class-name"</span>, no_default_constructor)
</pre>
</div>
</div>

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Inheritance</h3>
<div class="outline-text-3" id="text-6-1">
<p>
clbind can handle member functions of derived classes correctly, providing that they are exposed.
To expose the inheritance structure of C++ classes, expose the base class, and use the following format for the derived class:
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-type">class_</span>&lt;CppDerivedClassName, CppBaseClassName&gt;(<span class="org-string">"lisp-class-name"</span>)
</pre>
</div>
<p>
If multiple inheritance brings in several base classes, use the following format:
</p>
<div class="org-src-container">

<pre class="src src-C++">class_&lt;CppDerivedClassName, bases&lt;CppBaseClassName1, CppBaseClassName2&gt;&gt;(<span class="org-string">"lisp-class-name"</span>)
</pre>
</div>
<p>
If a base class is a pure virtual class, i.e. it has only pure virtual functions or its constructor is private, make sure to use the <code>no_default_constructor</code> option when exposing the base class, otherwise you will get a compilation error.
</p>
</div>
</div>
