org/clbind-doc.org
** Constructors
Add constructors to exposed classes with the function ~def_constructor~:
#+BEGIN_SRC C++
template<typename... Types>
class_& def_constructor(const string&         name,
                        constructor<Types...> sig,
                        const Policies&       policies,
                        string const&         arguments = "",
                        string const&         declares  = "",
                        string const&         docstring = "")
#+END_SRC
In this function
- name :: is the name of the constructor that will be visible in clasp. Again, it will be lispified.
- sig :: is the parameter signature of the C++ constructor. Use a comma-separated parameter-list list in the form ~constructor<parameter-list>()~ of all the types used as parameters in the constructor you want to expose.
- policies, arguments, declares, docstring :: Optional parameters, explained in [[Exposing Functions][Exposing Functions]]

** Member Functions
Exposing member functions is similar to exposing free functions. Call the ~class_~ member function ~def~:
#+BEGIN_SRC C++
template<class F, class DefaultOrPolicies>
class_& def(char const*       name, 
            F                 fn, 
            DefaultOrPolicies default_or_policies,
            string const&     arguments = "",
            string const&     declares  = "",
            string const&     docstring = "")
#+END_SRC
Thus exposing a member function is not different from [[Exposing Function][exposing free functions]], and the same arguments apply. (?? difference between policies and DefaultOrPolicies ??)
The exception to this rule is the lambda-list (arguments), which always requires ~self~ as its first parameter, which becomes the ~this~ argument within the method.

** Static Member Function
As Common Lisp does not have the notion of static member functions, exposing them is similar to [[Exposing Functions][exposing free functions]].

** Public Member Variables
Exposing public member variables works similar to exposing member functions. 

* Translators
Translators can be used to automatically convert C++ objects to Common Lisp objects and vice versa. This is mainly a convenience functionality, allowing for easier integration. It is especially useful for small C++ classes and structs that are passed to and from functions and are meant to be created on the fly. Instead of exposing them and then creating and filling them from Common Lisp, it is often easier to write a translator, e.g. from a list, which makes it possible to pass a list as a parameter in place of the object. This list is then automatically converted to the respective C++ object by the translator.

(?? Translators are missing info on pointer adoption, true_type, false_type,... ??)

** Translation from C++ objects to Common Lisp objects 
Translating from C++ to Common Lisp objects is done by specializing the templated struct ~to_object~ in the namespace ~translate~ to the type of the C++ object, with the static function member function convert of that struct taking an object of that type as a parameter and returning the Clasp Common Lisp Object:
#+BEGIN_SRC C++
namespace translate
{
  template <>
  class to_object<CppTypeToTranslateFrom> 
  {
    static core::T_sp convert(CppTypeToTranslateFrom cppObject)
    {
       core::Cons_sp cons; //use a cons object in this example
       //convert cppObject to an object derived from core::T_sp (here: Cons_sp).
       return cons;
    }
  };
};
#+END_SRC


** Translation from Common Lisp objects to C++ objects 
Translating from Common Lisp to C++ objects is done by specializing the templated struct ~from_object~ in the namespace ~translate~ to the C++ object type and providing a constructor that takes the Common Lisp object as a parameter and writes the result into an object called _v of the C++ object type:
(?? is the typedef DeclareType a must or just a convention ??)
#+BEGIN_SRC C++
namespace translate
{
  template <>
  struct from_object<CppTypeToTranslateTo> 
  {
    typedef CppTypeToTranslateTo DeclareType;
    DeclareType _v;
    from_object(const core::T_sp& obj)
    {
      //convert obj and store the result in _v.
    }
  };
};
#+END_SRC

* Exposing Enums
Exposing Enums is not finalized, yet. 
See [[https://github.com/HeyFlash/SFML/blob/master/include/CLASP-SFML/Window/Event.hpp][ClaspBindingWindow]] and [[https://github.com/HeyFlash/SFML/blob/master/include/CLASP-SFML/Window/Event.hpp][Event translators]] in the SFML binding for currently working translators. This *will break* in future releases of Clasp.

* Policies
??
