clbind-doc.html

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Constructors</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Add constructors to exposed classes with the function <code>def_constructor</code>:
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">template</span>&lt;<span class="org-keyword">typename</span>... Types&gt;
<span class="org-type">class_</span>&amp; <span class="org-function-name">def_constructor</span>(<span class="org-keyword">const</span> <span class="org-type">string</span>&amp;         <span class="org-variable-name">name</span>,
                        <span class="org-type">constructor</span>&lt;Types...&gt; <span class="org-variable-name">sig</span>,
                        <span class="org-keyword">const</span> <span class="org-type">Policies</span>&amp;       <span class="org-variable-name">policies</span>,
                        <span class="org-type">string</span> <span class="org-keyword">const</span>&amp;         <span class="org-variable-name">arguments</span> = <span class="org-string">""</span>,
                        <span class="org-type">string</span> <span class="org-keyword">const</span>&amp;         <span class="org-variable-name">declares</span>  = <span class="org-string">""</span>,
                        <span class="org-type">string</span> <span class="org-keyword">const</span>&amp;         <span class="org-variable-name">docstring</span> = <span class="org-string">""</span>)
</pre>
</div>
<p>
In this function
</p>
<dl class="org-dl">
<dt> name </dt><dd>is the name of the constructor that will be visible in clasp. Again, it will be lispified.
</dd>
<dt> sig </dt><dd>is the parameter signature of the C++ constructor. Use a comma-separated parameter-list list in the form <code>constructor&lt;parameter-list&gt;()</code> of all the types used as parameters in the constructor you want to expose.
</dd>
<dt> policies, arguments, declares, docstring </dt><dd>Optional parameters, explained in <a href="#sec-5">Exposing Functions</a>
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Member Functions</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Exposing member functions is similar to exposing free functions. Call the <code>class_</code> member function <code>def</code>:
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">template</span>&lt;<span class="org-keyword">class</span> <span class="org-type">F</span>, <span class="org-keyword">class</span> <span class="org-type">DefaultOrPolicies</span>&gt;
<span class="org-type">class_</span>&amp; <span class="org-function-name">def</span>(<span class="org-type">char</span> <span class="org-keyword">const</span>*       <span class="org-variable-name">name</span>, 
            <span class="org-type">F</span>                 <span class="org-variable-name">fn</span>, 
            <span class="org-type">DefaultOrPolicies</span> <span class="org-variable-name">default_or_policies</span>,
            <span class="org-type">string</span> <span class="org-keyword">const</span>&amp;     <span class="org-variable-name">arguments</span> = <span class="org-string">""</span>,
            <span class="org-type">string</span> <span class="org-keyword">const</span>&amp;     <span class="org-variable-name">declares</span>  = <span class="org-string">""</span>,
            <span class="org-type">string</span> <span class="org-keyword">const</span>&amp;     <span class="org-variable-name">docstring</span> = <span class="org-string">""</span>)
</pre>
</div>
<p>
Thus exposing a member function is not different from <i>exposing free functions</i>, and the same arguments apply. (?? difference between policies and DefaultOrPolicies ??)
The exception to this rule is the lambda-list (arguments), which always requires <code>self</code> as its first parameter, which becomes the <code>this</code> argument within the method.
</p>
</div>
</div>

<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> Static Member Function</h3>
<div class="outline-text-3" id="text-6-4">
<p>
As Common Lisp does not have the notion of static member functions, exposing them is similar to <a href="#sec-5">exposing free functions</a>.
</p>
</div>
</div>

<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> Public Member Variables</h3>
<div class="outline-text-3" id="text-6-5">
<p>
Exposing public member variables works similar to exposing member functions. 
</p>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Translators</h2>
<div class="outline-text-2" id="text-7">
<p>
Translators can be used to automatically convert C++ objects to Common Lisp objects and vice versa. This is mainly a convenience functionality, allowing for easier integration. It is especially useful for small C++ classes and structs that are passed to and from functions and are meant to be created on the fly. Instead of exposing them and then creating and filling them from Common Lisp, it is often easier to write a translator, e.g. from a list, which makes it possible to pass a list as a parameter in place of the object. This list is then automatically converted to the respective C++ object by the translator.
</p>

<p>
(?? Translators are missing info on pointer adoption, true_type, false_type,&#x2026; ??)
</p>
</div>

<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Translation from C++ objects to Common Lisp objects</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Translating from C++ to Common Lisp objects is done by specializing the templated struct <code>to_object</code> in the namespace <code>translate</code> to the type of the C++ object, with the static function member function convert of that struct taking an object of that type as a parameter and returning the Clasp Common Lisp Object:
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">namespace</span> <span class="org-constant">translate</span>
{
  <span class="org-keyword">template</span> &lt;&gt;
  <span class="org-keyword">class</span> <span class="org-type">to_object</span>&lt;CppTypeToTranslateFrom&gt; 
  {
    <span class="org-keyword">static</span> <span class="org-constant">core</span>::<span class="org-type">T_sp</span> <span class="org-function-name">convert</span>(<span class="org-type">CppTypeToTranslateFrom</span> <span class="org-variable-name">cppObject</span>)
    {
       <span class="org-constant">core</span>::<span class="org-type">Cons_sp</span> <span class="org-variable-name">cons</span>; <span class="org-comment-delimiter">//</span><span class="org-comment">use a cons object in this example</span>
       <span class="org-comment-delimiter">//</span><span class="org-comment">convert cppObject to an object derived from core::T_sp (here: Cons_sp).</span>
       <span class="org-keyword">return</span> cons;
    }
  };
};
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Translation from Common Lisp objects to C++ objects</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Translating from Common Lisp to C++ objects is done by specializing the templated struct <code>from_object</code> in the namespace <code>translate</code> to the C++ object type and providing a constructor that takes the Common Lisp object as a parameter and writes the result into an object called _v of the C++ object type:
(?? is the typedef DeclareType a must or just a convention ??)
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">namespace</span> <span class="org-constant">translate</span>
{
  <span class="org-keyword">template</span> &lt;&gt;
  <span class="org-keyword">struct</span> <span class="org-type">from_object</span>&lt;CppTypeToTranslateTo&gt; 
  {
    <span class="org-keyword">typedef</span> <span class="org-type">CppTypeToTranslateTo</span> <span class="org-type">DeclareType</span>;
    <span class="org-type">DeclareType</span> <span class="org-variable-name">_v</span>;
    <span class="org-function-name">from_object</span>(<span class="org-keyword">const</span> <span class="org-constant">core</span>::<span class="org-type">T_sp</span>&amp; <span class="org-variable-name">obj</span>)
    {
      <span class="org-comment-delimiter">//</span><span class="org-comment">convert obj and store the result in _v.</span>
    }
  };
};
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Exposing Enums</h2>
<div class="outline-text-2" id="text-8">
<p>
Exposing Enums is not finalized, yet. 
See <a href="https://github.com/HeyFlash/SFML/blob/master/include/CLASP-SFML/Window/Event.hpp">ClaspBindingWindow</a> and <a href="https://github.com/HeyFlash/SFML/blob/master/include/CLASP-SFML/Window/Event.hpp">Event translators</a> in the SFML binding for currently working translators. This <b>will break</b> in future releases of Clasp.
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Policies</h2>
<div class="outline-text-2" id="text-9">
<p>
??
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<center><p>
<a href="sitemap.html">Sitemap</a> &#x2014; <a href="license.html">License</a>
</p>
</center>
</div>
</body>
</html>
